import pandas as pd
import numpy as np

# сформируем регионы - данные взяты из открытых источников с помощью поисковика (30 наиболее населенных пунктов за 2025 год)
regions_list = [
    ['Оренбургская область', 'Область', 54.7276647, 52.0269262, 'rn_13614534'],
    ['Краснодарский край', 'Край', 39.0261044, 45.7684014, 'rn_26701781'],
    ['Башкортостан', 'Республика', 55.9784582, 54.4747553, 'rn_37879921'],
    ['Татарстан', 'Республика', 50.4763591, 55.448217, 'rn_21531897'],
    ['Ростовская область', 'Область', 40.7957942, 47.6222451, 'rn_19766099'],
    ['Свердловская область', 'Область', 61.8021546, 58.6414755, 'rn_60280324'],
    ['Алтайский край', 'Край', 82.6931424, 52.6932243, 'rn_84231005'],
    ['Пермский край', 'Край', 56.3159546, 58.5951603, 'rn_26161112'],
    ['Белгородская область', 'Область', 37.5837615, 50.7080119, 'rn_16774928'],
    ['Иркутская область', 'Область', 104.719221, 56.6370122, 'rn_53964319'],
    ['Хабаровский край', 'Край', 136.121524, 51.6312684, 'rn_47253824'],
    ['Кемеровская область', 'Область', 87.342861, 54.5335781, 'rn_55690375'],
    ['Московская область', 'Область', 38.0353929, 55.5043158, 'rn_39929332'],
    ['Нижегородская область', 'Область', 44.0911594, 55.4718033, 'rn_66416915'],
    ['Саратовская область', 'Область', 46.8631952, 51.6520555, 'rn_60603560'],
    ['Красноярский край', 'Край', 97.0979974, 63.3233807, 'rn_93876037'],
    ['Архангельская область', 'Область', 43.1221646, 63.5589686, 'rn_34941040'],
    ['Томская область', 'Область', 82.0475315, 58.6124279, 'rn_92084290'],
    ['Астраханская область', 'Область', 47.608851, 47.1878186, 'rn_76417224'],
    ['Челябинская область', 'Область', 61.1865846, 54.4223954, 'rn_50839283'],
    ['Новосибирская область', 'Область', 78.866158, 55.8204953, 'rn_77395529'],
    ['Ставропольский край', 'Край', 43.4406913, 44.8632577, 'rn_59131408'],
    ['Воронежская область', 'Область', 40.1506507, 50.9800393, 'rn_75740484'],
    ['Ленинградская область', 'Область', 32.3925325, 60.1853296, 'rn_59484170'],
    ['Дагестан', 'Республика', 47.0, 43.0, 'rn_29998722'],
    ['Волгоградская область', 'Область', 44.2903582, 49.6048339, 'rn_98966251'],
    ['Самарская область', 'Область', 50.5873689, 52.676757, 'rn_11595782'],
    ['Тюменская область', 'Область', 70.3658837, 58.8206488, 'rn_96128144'],
    ['Москва', 'Город федерального значени', 37.6063916, 55.625578, 'rn_15716747'],
    ['Санкт-Петербург', 'Город федерального значени', 30.1586551, 59.9606739, 'rn_92990339']
]
regions_columns = ['region_name', 'region_type', 'region_latitude', 'region_longitude', 'region_id']
edtech_regions = pd.DataFrame(regions_list, columns=regions_columns)

# формируем продажи edtech_sales
edtech_sales = pd.DataFrame(columns=[
    'education_date',
    'education_tier',
    'education_price',
    'education_revenue'
])

np.random.seed(18)
start_date = pd.Timestamp('2024-03-01')
end_date = pd.Timestamp('2026-02-28')
total_days = (end_date-start_date).days
random_days = np.random.randint(0, total_days + 1, size=500_000)
random_dates = start_date + pd.to_timedelta(random_days, unit='D')

# заполним education_price, дополнив датафрейм course_id (сгенерированный ранее)
group_a = {
    'ctc_18370989': 15000,
    'ctc_26789811': 15000,
    'ctc_37168107': 15000,
    'ctc_95333458': 15000,
    'ctc_51327058': 5750,
    'ctc_58630012': 5750,
    'ctc_23342832': 15000,
    'ctc_53467772': 15000,
    'ctc_15443882': 10000,
    'ctc_50766727': 10000}

group_b = {
    'ctc_15129525': 11500,
    'ctc_14289319': 11500,
    'ctc_31400736': 11500,
    'ctc_36951480': 11500,
    'ctc_72806038': 11500,
    'ctc_39025723': 11500,
    'ctc_90137610': 11500,
    'ctc_48866036': 11500,
    'ctc_16786265': 11500,
    'ctc_79243120': 11500,
    'ctc_82977687': 11500,
    'ctc_16867120': 11500,
    'ctc_91727425': 11500,
    'ctc_57132080': 11500,
    'ctc_53011451': 11500,
    'ctc_13013402': 11500,
    'ctc_42776213': 11500,
    'ctc_95887819': 11500,
    'ctc_37712212': 11500,
    'ctc_35858631': 11500,
    'ctc_98674594': 11500,
    'ctc_51021155': 11500,
    'ctc_72020472': 11500,
    'ctc_34590614': 11500,
    'ctc_91494828': 11500,
    'ctc_78563662': 11500,
    'ctc_64464481': 11500,
    'ctc_64753860': 11500,
    'ctc_46884638': 11500,
    'ctc_72819932': 11500}

total_rows = 500_000
group_a_size = total_rows // 2  # количество строк для каждой группы 50 на 50
group_b_size = total_rows - group_a_size
# группа A
course_ids_a = list(group_a.keys())
course_ids_group_a = np.random.choice(course_ids_a, size=group_a_size)
# группа B
course_ids_b = list(group_b.keys())
course_ids_group_b = np.random.choice(course_ids_b, size=group_b_size)
all_course_ids = np.concatenate([course_ids_group_a, course_ids_group_b])
np.random.shuffle(all_course_ids) # перемешиваем
full_mapping = {**group_a, **group_b}
edtech_sales['course_id'] = all_course_ids
edtech_sales['education_price'] = edtech_sales['course_id'].map(full_mapping)

# дополним датафрейм learner_id (сгенерированный ранее)
learner_ids = ['lt_47616258', 'lt_95958876', 'lt_63846148']
probabilities = [0.7, 0.15, 0.15]
edtech_sales['learner_id'] = np.random.choice(learner_ids, size=500_000, p=probabilities) # распределяем значения с заданными вероятностями вхождений

# дополним датафрейм platform_id (сгенерированный ранее)
platform_ids = ['pl_31087195', 'pl_93310925', 'pl_56704672']
edtech_sales['platform_id'] = np.random.choice(platform_ids, size=500_000)

# дополним датафрейм instructor_id (сгенерированный ранее)
instructor_ids = ['in_47122796', 'in_99745172', 'in_41966045', 'in_77755618', 'in_38183807']
edtech_sales['instructor_id'] = np.random.choice(instructor_ids, size=500_000)

# заполним education_tier (напомню что уровень пакета обучения, напрямую влияет на его стоимость)
tier_values = [1, 2, 3] # 1 - базовый; 2 - расширенный; 3 - полная поддержка + дополнительные материалы
probabilities = [0.55, 0.20, 0.25]
education_tier_values = np.random.choice(tier_values, size=500_000, p=probabilities)
edtech_sales['education_tier'] = education_tier_values

# заполним education_revenue (произведение education_tier и education_price)
edtech_sales['education_revenue'] = edtech_sales['education_tier'] * edtech_sales['education_price']

# заключительная часть формирования основного датафрейма продаж edtech_sales, дополним его region_id
# воспользуемся исходными значениями списка region_id, так чтобы два региона получили максимальную долю продаж
region_ids = [
    'rn_13614534', 'rn_26701781', 'rn_37879921', 'rn_21531897',
    'rn_19766099', 'rn_60280324', 'rn_84231005', 'rn_26161112',
    'rn_16774928', 'rn_53964319', 'rn_47253824', 'rn_55690375',
    'rn_39929332', 'rn_66416915', 'rn_60603560', 'rn_93876037',
    'rn_34941040', 'rn_92084290', 'rn_76417224', 'rn_50839283',
    'rn_77395529', 'rn_59131408', 'rn_75740484', 'rn_59484170',
    'rn_29998722', 'rn_98966251', 'rn_11595782', 'rn_96128144',
    'rn_15716747', 'rn_92990339'
]
special_ids = ['rn_15716747', 'rn_92990339']
special_percentage = 0.65
total_rows = 500000
special_count = int(total_rows * special_percentage)
special_per_id = special_count // 2
other_ids = [rid for rid in region_ids if rid not in special_ids]
other_count = total_rows - special_count
values = []
values.extend([special_ids[0]] * special_per_id)
values.extend([special_ids[1]] * (special_count - special_per_id))
other_per_id = other_count // len(other_ids)
remainder = other_count % len(other_ids)

for rid in other_ids:
    count = other_per_id + (1 if remainder > 0 else 0)
    values.extend([rid] * count)
    if remainder > 0:
        remainder -= 1
np.random.shuffle(values)
edtech_sales['region_id'] = values

# датафрейм instructors (значения ids сгенерированы ранее)
edtech_instructors = pd.DataFrame({
    'instructor_id': [
        'in_47122796',
        'in_99745172',
        'in_41966045',
        'in_77755618',
        'in_38183807'
    ],
    'instructor_name': [
        'Преподаватель 1',
        'Преподаватель 2',
        'Преподаватель 3',
        'Преподаватель 4',
        'Преподаватель 5'
    ]
})

# датафрейм platforms (значения ids сгенерированы ранее)
edtech_platforms = pd.DataFrame({
    'platform_id': [
        'pl_31087195',
        'pl_93310925',
        'pl_56704672'
    ],    
    'platform_learning': [
        'веб‑сайт',
        'мобильное приложение',
        'LMS'
    ]
})

# датафрейм learners (значения ids сгенерированы ранее)
edtech_learners = pd.DataFrame({
    'learner_id': [
        'lt_47616258',
        'lt_95958876',
        'lt_63846148'
    ],
    'learner_type': [
        'Индивидуальное',
        'Корпоративное',
        'Грантовое'
    ]
})

# датафрейм courses (значения ids сгенерированы ранее)
edtech_courses = pd.DataFrame({
    'course_id': [
        'ctc_18370989', 'ctc_26789811', 'ctc_37168107', 'ctc_95333458',
        'ctc_51327058', 'ctc_58630012', 'ctc_23342832', 'ctc_53467772',
        'ctc_15443882', 'ctc_50766727', 'ctc_15129525', 'ctc_14289319',
        'ctc_31400736', 'ctc_36951480', 'ctc_72806038', 'ctc_39025723',
        'ctc_90137610', 'ctc_48866036', 'ctc_16786265', 'ctc_79243120',
        'ctc_82977687', 'ctc_16867120', 'ctc_91727425', 'ctc_57132080',
        'ctc_53011451', 'ctc_13013402', 'ctc_42776213', 'ctc_95887819',
        'ctc_37712212', 'ctc_35858631', 'ctc_98674594', 'ctc_51021155',
        'ctc_72020472', 'ctc_34590614', 'ctc_91494828', 'ctc_78563662',
        'ctc_64464481', 'ctc_64753860', 'ctc_46884638', 'ctc_72819932'
    ],
    'course_title': [
        'Основы SQL для аналитиков',
        'Оптимизация SQL для больших данных',
        'Python (Pandas) - анализ бизнес‑данных',
        'Визуализация данных на Python - дашборды',
        'Excel для аналитики - Power Query/Pivot',
        'Автоматизация отчетов в Excel',
        'Power BI - корпоративные дашборды',
        'Apache Superset - корпоративные дашборды',
        'A/B‑тестирование - анализ и выводы',
        'Статистика для аналитиков - от данных к выводам',
        'Продуктовая аналитика: метрики роста и retention',
        'Воронка конверсии: анализ и оптимизация',
        'Cohort‑анализ для продуктовых команд',
        'Анализ пользовательского поведения в продукте',
        'A/B‑тесты в продуктовой разработке',
        'Power BI: от данных к интерактивным дашбордам',
        'Apache Superset: визуализация и мониторинг метрик',
        'Tableau: продвинутая визуализация данных',
        'ETL‑процессы для BI‑систем',
        'Дашборды для топ‑менеджмента: лучшие практики',
        'Основы аналитики данных: от сбора до выводов',
        'Описательная и диагностическая аналитика',
        'Прогнозирование на основе данных (предиктивная аналитика)',
        'Работа с Big Data: основы Hadoop и Spark',
        'Data Mining: поиск закономерностей в данных',
        'Бизнес‑анализ: выявление и приоритизация требований',
        'Моделирование бизнес‑процессов (BPMN)',
        'Анализ данных для принятия бизнес‑решений',
        'KPI и метрики эффективности бизнеса',
        'Подготовка аналитических отчетов для руководства',
        'Системный анализ: сбор и документирование требований',
        'UML и BPMN: моделирование бизнес‑процессов',
        'Интеграции систем: API и микросервисы',
        'Работа с REST и SOAP API',
        'Проектирование технических решений',
        'Маркетинговая аналитика: ROI и LTV',
        'Анализ эффективности рекламных кампаний',
        'Веб‑аналитика: Google Analytics и Яндекс.Метрика',
        'Attribution‑модели в маркетинге',
        'Сегментация аудитории для таргетированных кампаний'
    ],
    'course_category': [
        'SQL', 'SQL', 'Python', 'Python', 'Excel', 'Excel',
        'BI-tools', 'BI-tools', 'Статистика', 'Статистика',
        'Продуктовая аналитика', 'Продуктовая аналитика', 'Продуктовая аналитика',
        'Продуктовая аналитика', 'Продуктовая аналитика', 'BI‑аналитика',
        'BI‑аналитика', 'BI‑аналитика', 'BI‑аналитика', 'BI‑аналитика',
        'Аналитика данных', 'Аналитика данных', 'Аналитика данных',
        'Аналитика данных', 'Аналитика данных', 'Бизнес‑аналитика',
        'Бизнес‑аналитика', 'Бизнес‑аналитика', 'Бизнес‑аналитика',
        'Бизнес‑аналитика', 'Системная аналитика', 'Системная аналитика',
        'Системная аналитика', 'Системная аналитика', 'Системная аналитика',
        'Маркетинговая аналитика', 'Маркетинговая аналитика',
        'Маркетинговая аналитика', 'Маркетинговая аналитика',
        'Маркетинговая аналитика'
    ]
})

# формируем итоговый датасет в excel на отдельных листах, состоящий из 6 датафреймов (воспроизведем структуру БД (postgres) в datalens исходя из возможностей)
dataframes = [edtech_sales, edtech_courses, edtech_instructors, edtech_learners, edtech_platforms, df]
sheet_names = ['edtech_sales', 'edtech_courses', 'edtech_instructors', 'edtech_learners', 'edtech_platforms', 'edtech_regions']

with pd.ExcelWriter('edtech.xlsx', engine='openpyxl') as writer:
    for df, sheet_name in zip(dataframes, sheet_names):
        try:
            df.to_excel(writer, sheet_name=sheet_name, index=False)
            print(f"лист '{sheet_name}' добавлен!")
        except Exception as e:
            print(f"ошибка при записи листа '{sheet_name}' - {e}")

print("датасет 'edtech.xlsx' успешно сформирован!")